class PointsInfo {
  String eventsTitle,
      location,
      points,
      eventsDetail,
      organizer,
      startDate,
      endDate;
  int pointsNum;

  PointsInfo({
    this.eventsTitle,
    this.location,
    this.points,
    this.eventsDetail,
    this.organizer,
    this.endDate,
    this.startDate,
    this.pointsNum
  });
}

final List<PointsInfo> pointsList = [
  PointsInfo(
      eventsTitle: "史學系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "德2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 2,
      ),
  PointsInfo(
      eventsTitle: "資傳系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "德2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 3,),
  PointsInfo(
      eventsTitle: "地理系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "德2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 4,),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
];

final List<PointsInfo> pointsList1 = [
  PointsInfo(
      eventsTitle: "智史學系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "智2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 2,
      ),
  PointsInfo(
      eventsTitle: "資傳系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "智2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 3,),
  PointsInfo(
      eventsTitle: "地理系專題講座:疫情與政治：近代中國的微生物與歷史研究",
      location: "校內：大孝館 8樓 孝810柏英演藝中心",
      points: "智2點",
      eventsDetail: "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講",
      organizer: "史學系",
      startDate: "2020/09/16 15:00",
      endDate: "2020/09/16 17:00",
      pointsNum: 4,),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
  //PointsInfo("史學系專題講座:疫情與政治：近代中國的微生物與歷史研究", "校內：大孝館 8樓 孝810柏英演藝中心", "德2點", "講題:疫情與政治：近代中國的微生物與歷史研究邀請:中央大學歷史研究所皮國立副教授蒞校演講", "史學系", "2020/09/16 15:00", "2020/09/16 17:00"),
];


